run/tutorials/heatTransfer/chtMultiRegionSimpleFoam/cpuCabinet/0.orig/domain0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
     #includeEtc "caseDicts/setConstraintTypes"

    FAN_SHROUD
    {
        type            externalWallHeatFluxTemperature;
        kappaMethod     fluidThermo;
        mode            flux;
        Ta              $internalField;
        q               uniform 0;
        value           $internalField;
        kappaName       none;
    }

    CABINET
    {
        type            externalWallHeatFluxTemperature;
        kappaMethod     fluidThermo;
        mode            flux;
        Ta              $internalField;
        q               uniform 0;
        value           $internalField;
        kappaName       none;
    }

    FINS
    {
        type            externalWallHeatFluxTemperature;
        kappaMethod     fluidThermo;
        mode            flux;
        Ta              $internalField;
        q               uniform 0;
        value           $internalField;
        kappaName       none;
    }

    PROCESSOR
    {
        type            externalWallHeatFluxTemperature;
        kappaMethod     fluidThermo;
        mode            flux;
        Ta              $internalField;
        q               uniform 0;
        value           $internalField;
        kappaName       none;
    }

    FAN
    {
        type            externalWallHeatFluxTemperature;
        kappaMethod     fluidThermo;
        mode            flux;
        Ta              $internalField;
        q               uniform 0;
        value           $internalField;
        kappaName       none;
    }

    MRF_region
    {
        type            externalWallHeatFluxTemperature;
        kappaMethod     fluidThermo;
        mode            flux;
        Ta              $internalField;
        q               uniform 0;
        value           $internalField;
        kappaName       none;
    }

    OUTLET_01
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    OUTLET_02
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    domain0_to_v_CPU
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        qrNbr           none;
        qr              none;
        Tnbr            T;
        kappaMethod     fluidThermo;
        useImplicit     true;
        value           $internalField;
    }

    domain0_to_v_fins
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        Tnbr            T;
        kappaMethod     fluidThermo;
        useImplicit     true;
        qrNbr           none;
        qr              none;
        value           $internalField;
    }
}

// ************************************************************************* //
